// Написать программу, которая на входе принимает число и выдает его квадрат. 
Console.WriteLine("Ведите номер  -> ");
int num = int.Parse(Console.ReadLine());
int numResult = num * num;
Console.WriteLine(numResult);
Console.ReadKey();

